[
  {
    "id": 1,
    "title": "Software Engineer",
    "company": "Amazon",
    "location": "Mumbai",
    "type": "Full-time",
    "salary": "10LPA - 12LPA",
    "experience": "3-6 Years",
    "opening": "48",
    "application": "492",
    "description": "Coordination with system analysts to understand requirements. Responsible for the design, development, testing, support and deploy custom web applications. Strong knowledge of .NET web frameworks such as ASP.NET or ASP.NET Knowledge of .NET languages (e.g. C#, or Visual Basic .NET), JavaScript, and HTML5/CSS33. Design & develop interfacing tools with other systems. Reporting configuration and deployment. Well-versed with technologies like ASP.NET , SQL Server Debugging programs in the software development stage or helping customers resolve issues Diagnose and resolve clients' questions or problems.",
    "companyType": "Tech",
    "benefits": "Pulled from the full job description. Paid sick time. Paid time off. Work from home",
    "shift": "Night Shift",
    "department": "Engineering - Software & QA",
    "education": "UG: Any Graduate. PG: Any Postgraduate. Doctorate: Any Doctorate",
    "skills": "Fullstack Development. Django Framework. Node.Js. React. Python. Mern Stack. Express. Mean Stack. MongoDB",
    "email": "abcd@gmail.com",
    "aboutcompany": "Riktam Technology is a leading implementer of web and mobile application software and provides services to a variety of clients across a range of industries We are a leader in Web and iPhone application development solutions and through the years we have achieved a reputation as a leading solutions- oriented company focused on the development of applications for the international market For more details visit our site \n www.riktamtech.com\n Company Info. Address: 101, 8-3-960/6/2, WINGS, SRINAGAR COLONY, Hyderabad, Telangana, India",
    "postedDate": "2024-07-27T00:00:00.000Z"
  },
  {
    "id": 2,
    "title": "Data Scientist",
    "company": "Google",
    "location": "Bangalore",
    "type": "Full-time",
    "salary": "15LPA - 20LPA",
    "experience": "2-5 Years",
    "opening": "35",
    "application": "310",
    "description": "Analyze large datasets to extract meaningful insights. Develop predictive models and machine learning algorithms. Collaborate with cross-functional teams to integrate data-driven solutions. Proficiency in Python, R, SQL, and machine learning frameworks. Strong understanding of statistical analysis and data visualization techniques.",
    "companyType": "Tech",
    "benefits": "Health insurance. Stock options. Paid vacation. Flexible work hours",
    "shift": "Day Shift",
    "department": "Data Science",
    "education": "UG: Any Graduate. PG: MSc in Data Science/Statistics or equivalent.",
    "skills": "Python. R. SQL. Machine Learning. Data Visualization. Statistical Analysis. TensorFlow. Scikit-learn",
    "email": "recruitment@google.com",
    "aboutcompany": "Google is a multinational technology company specializing in Internet-related services and products. Its most notable services include search engines, online advertising, and cloud computing. For more details visit www.google.com.",
    "postedDate": "2024-08-01T00:00:00.000Z"
  },
  {
    "id": 3,
    "title": "UX Designer",
    "company": "Microsoft",
    "location": "Hyderabad",
    "type": "Contract",
    "salary": "8LPA - 12LPA",
    "experience": "4-7 Years",
    "opening": "20",
    "application": "200",
    "description": "Design intuitive and user-friendly interfaces for various applications. Conduct user research and usability testing. Collaborate with product managers and engineers to create design solutions. Proficiency in design tools like Sketch, Figma, Adobe XD. Strong portfolio showcasing UX design projects.",
    "companyType": "Tech",
    "benefits": "Health benefits. Work from home options. Professional development opportunities.",
    "shift": "Day Shift",
    "department": "Design",
    "education": "UG: Any Graduate. PG: Degree in Design or related field.",
    "skills": "UX Design. User Research. Wireframing. Prototyping. Usability Testing. Sketch. Figma. Adobe XD",
    "email": "careers@microsoft.com",
    "aboutcompany": "Microsoft is a global leader in software, services, devices, and solutions that help people and businesses realize their full potential. For more details visit www.microsoft.com.",
    "postedDate": "2024-08-02T00:00:00.000Z"
  },
  {
    "id": 4,
    "title": "Marketing Manager",
    "company": "Facebook",
    "location": "Gurgaon",
    "type": "Full-time",
    "salary": "12LPA - 16LPA",
    "experience": "5-8 Years",
    "opening": "15",
    "application": "150",
    "description": "Develop and implement marketing strategies to promote products and services. Analyze market trends and customer data to inform decisions. Lead marketing campaigns and manage budgets. Experience with digital marketing tools and analytics platforms.",
    "companyType": "Tech",
    "benefits": "Health insurance. Paid time off. Performance bonuses.",
    "shift": "Day Shift",
    "department": "Marketing",
    "education": "UG: Any Graduate. PG: MBA in Marketing or related field.",
    "skills": "Marketing Strategy. Digital Marketing. Data Analysis. Campaign Management. Budget Management. SEO. SEM. Google Analytics",
    "email": "jobs@facebook.com",
    "aboutcompany": "Facebook is a global social media company that connects people through its platform, offering various services for social networking, marketing, and communication. For more details visit www.facebook.com.",
    "postedDate": "2024-08-03T00:00:00.000Z"
  },
  {
    "id": 5,
    "title": "Project Manager",
    "company": "IBM",
    "location": "Pune",
    "type": "Full-time",
    "salary": "14LPA - 18LPA",
    "experience": "6-9 Years",
    "opening": "10",
    "application": "100",
    "description": "Oversee and manage project lifecycle from initiation to closure. Coordinate with stakeholders and ensure project delivery on time and within budget. Manage project risks and issues. Proficiency in project management methodologies (e.g., Agile, Scrum).",
    "companyType": "Tech",
    "benefits": "Health benefits. Retirement plans. Paid vacation. Training opportunities.",
    "shift": "Day Shift",
    "department": "Project Management",
    "education": "UG: Any Graduate. PG: MBA or equivalent.",
    "skills": "Project Management. Agile. Scrum. Risk Management. Stakeholder Communication. Budget Management. Microsoft Project",
    "email": "careers@ibm.com",
    "aboutcompany": "IBM is a multinational technology and consulting company offering a wide range of products and services, including cloud computing, AI, and IT infrastructure. For more details visit www.ibm.com.",
    "postedDate": "2024-08-04T00:00:00.000Z"
  },
  {
    "id": 6,
    "title": "Graphic Designer",
    "company": "Adobe",
    "location": "Noida",
    "type": "Full-time",
    "salary": "9LPA - 13LPA",
    "experience": "3-5 Years",
    "opening": "25",
    "application": "250",
    "description": "Create visual designs for digital and print media. Collaborate with marketing and product teams to develop design concepts. Expertise in Adobe Creative Suite (Photoshop, Illustrator, InDesign). Strong portfolio with examples of graphic design work.",
    "companyType": "Tech",
    "benefits": "Health insurance. Work from home. Creative work environment.",
    "shift": "Day Shift",
    "department": "Design",
    "education": "UG: Any Graduate. PG: Degree in Design or related field.",
    "skills": "Graphic Design. Adobe Creative Suite. Photoshop. Illustrator. InDesign. Branding. Typography",
    "email": "jobs@adobe.com",
    "aboutcompany": "Adobe is a leading software company specializing in digital media solutions, including creative software, digital marketing tools, and document management systems. For more details visit www.adobe.com.",
    "postedDate": "2024-08-05T00:00:00.000Z"
  },
  {
    "id": 7,
    "title": "Business Analyst",
    "company": "SAP",
    "location": "Chennai",
    "type": "Contract",
    "salary": "11LPA - 14LPA",
    "experience": "4-6 Years",
    "opening": "30",
    "application": "280",
    "description": "Analyze business processes and requirements. Develop and document business requirements. Collaborate with stakeholders to design and implement solutions. Experience with business analysis tools and methodologies.",
    "companyType": "Tech",
    "benefits": "Health insurance. Paid time off. Professional development.",
    "shift": "Day Shift",
    "department": "Business Analysis",
    "education": "UG: Any Graduate. PG: MBA or equivalent.",
    "skills": "Business Analysis. Requirements Gathering. Process Improvement. Stakeholder Management. Data Analysis. Business Intelligence",
    "email": "careers@sap.com",
    "aboutcompany": "SAP is a global enterprise software company providing solutions for business operations, including ERP, CRM, and cloud services. For more details visit www.sap.com.",
    "postedDate": "2024-08-06T00:00:00.000Z"
  },
  {
    "id": 8,
    "title": "DevOps Engineer",
    "company": "Oracle",
    "location": "Delhi",
    "type": "Full-time",
    "salary": "13LPA - 17LPA",
    "experience": "5-8 Years",
    "opening": "18",
    "application": "160",
    "description": "Manage and automate deployment pipelines. Implement and maintain CI/CD processes. Collaborate with development teams to improve deployment workflows. Experience with Docker, Kubernetes, Jenkins.",
    "companyType": "Tech",
    "benefits": "Health benefits. Stock options. Flexible work hours.",
    "shift": "Day Shift",
    "department": "DevOps",
    "education": "UG: Any Graduate. PG: Degree in Engineering or related field.",
    "skills": "DevOps. CI/CD. Docker. Kubernetes. Jenkins. Automation. Cloud Platforms",
    "email": "jobs@oracle.com",
    "aboutcompany": "Oracle is a global technology company specializing in database software, cloud solutions, and enterprise applications. For more details visit www.oracle.com.",
    "postedDate": "2024-08-07T00:00:00.000Z"
  },
  {
    "id": 9,
    "title": "Network Engineer",
    "company": "Cisco",
    "location": "Bangalore",
    "type": "Full-time",
    "salary": "12LPA - 15LPA",
    "experience": "3-6 Years",
    "opening": "22",
    "application": "180",
    "description": "Design, implement, and manage network infrastructure. Troubleshoot and resolve network issues. Collaborate with IT teams to ensure network reliability. Proficiency in networking protocols and tools.",
    "companyType": "Tech",
    "benefits": "Health insurance. Paid vacation. Professional development.",
    "shift": "Day Shift",
    "department": "Network Engineering",
    "education": "UG: Any Graduate. PG: Degree in Engineering or related field.",
    "skills": "Networking. Network Design. Troubleshooting. Protocols. Cisco Systems. Network Security.",
    "email": "careers@cisco.com",
    "aboutcompany": "Cisco is a global leader in networking hardware, telecommunications equipment, and other high-technology services and products. For more details visit www.cisco.com.",
    "postedDate": "2024-08-08T00:00:00.000Z"
  },
  {
    "id": 10,
    "title": "HR Manager",
    "company": "Intel",
    "location": "Pune",
    "type": "Full-time",
    "salary": "11LPA - 14LPA",
    "experience": "5-7 Years",
    "opening": "12",
    "application": "140",
    "description": "Manage HR functions including recruitment, employee relations, and compliance. Develop and implement HR policies and programs. Collaborate with management to support organizational goals.",
    "companyType": "Tech",
    "benefits": "Health insurance. Paid time off. Retirement benefits.",
    "shift": "Day Shift",
    "department": "Human Resources",
    "education": "UG: Any Graduate. PG: MBA in HR or related field.",
    "skills": "Human Resources. Recruitment. Employee Relations. Compliance. HR Policies. Performance Management.",
    "email": "jobs@intel.com",
    "aboutcompany": "Intel is a multinational corporation and technology company known for its semiconductor chips and computing solutions. For more details visit www.intel.com.",
    "postedDate": "2024-08-09T00:00:00.000Z"
  },
  {
    "id": 11,
    "title": "Sales Executive",
    "company": "Salesforce",
    "location": "Mumbai",
    "type": "Full-time",
    "salary": "9LPA - 12LPA",
    "experience": "2-4 Years",
    "opening": "40",
    "application": "220",
    "description": "Generate leads and close sales for enterprise software solutions. Build and maintain client relationships. Achieve sales targets and quotas. Experience with CRM systems and sales strategies.",
    "companyType": "Tech",
    "benefits": "Health insurance. Performance bonuses. Career growth opportunities.",
    "shift": "Day Shift",
    "department": "Sales",
    "education": "UG: Any Graduate. PG: MBA in Sales or related field.",
    "skills": "Sales. CRM Systems. Lead Generation. Client Relations. Sales Strategy. Negotiation.",
    "email": "careers@salesforce.com",
    "aboutcompany": "Salesforce is a global leader in cloud-based customer relationship management (CRM) solutions. For more details visit www.salesforce.com.",
    "postedDate": "2024-08-10T00:00:00.000Z"
  },
  {
    "id": 12,
    "title": "Content Writer",
    "company": "HubSpot",
    "location": "Delhi",
    "type": "Full-time",
    "salary": "8LPA - 10LPA",
    "experience": "2-4 Years",
    "opening": "28",
    "application": "190",
    "description": "Create high-quality content for blogs, websites, and marketing materials. Research industry-related topics. Collaborate with marketing teams to develop content strategies. Strong writing and editing skills.",
    "companyType": "Tech",
    "benefits": "Health benefits. Paid time off. Professional development.",
    "shift": "Day Shift",
    "department": "Marketing",
    "education": "UG: Any Graduate. PG: Degree in English or related field.",
    "skills": "Content Writing. Editing. SEO. Blogging. Research. Content Strategy.",
    "email": "jobs@hubspot.com",
    "aboutcompany": "HubSpot is a leading provider of marketing, sales, and customer service software that helps businesses grow and succeed. For more details visit www.hubspot.com.",
    "postedDate": "2024-08-11T00:00:00.000Z"
  },
  {
    "id": 13,
    "title": "Database Administrator",
    "company": "Oracle",
    "location": "Chennai",
    "type": "Full-time",
    "salary": "12LPA - 16LPA",
    "experience": "4-7 Years",
    "opening": "20",
    "application": "170",
    "description": "Manage and maintain database systems. Ensure data integrity, security, and availability. Optimize database performance and troubleshoot issues. Experience with Oracle databases and SQL.",
    "companyType": "Tech",
    "benefits": "Health benefits. Retirement plans. Paid vacation.",
    "shift": "Day Shift",
    "department": "Database Management",
    "education": "UG: Any Graduate. PG: Degree in IT or related field.",
    "skills": "Database Administration. Oracle. SQL. Performance Tuning. Data Security. Backup and Recovery.",
    "email": "careers@oracle.com",
    "aboutcompany": "Oracle is a multinational technology company specializing in database software, cloud solutions, and enterprise applications. For more details visit www.oracle.com.",
    "postedDate": "2024-08-12T00:00:00.000Z"
  },
  {
    "id": 14,
    "title": "Front-End Developer",
    "company": "LinkedIn",
    "location": "Bangalore",
    "type": "Full-time",
    "salary": "11LPA - 14LPA",
    "experience": "3-5 Years",
    "opening": "25",
    "application": "210",
    "description": "Develop and maintain user interfaces for web applications. Collaborate with UX/UI designers and back-end developers. Expertise in HTML, CSS, JavaScript, and modern frameworks like React or Angular.",
    "companyType": "Tech",
    "benefits": "Health insurance. Paid time off. Career advancement opportunities.",
    "shift": "Day Shift",
    "department": "Engineering",
    "education": "UG: Any Graduate. PG: Degree in Computer Science or related field.",
    "skills": "HTML. CSS. JavaScript. React. Angular. Responsive Design. Web Development.",
    "email": "jobs@linkedin.com",
    "aboutcompany": "LinkedIn is a global professional networking site offering services for career development, job searching, and business networking. For more details visit www.linkedin.com.",
    "postedDate": "2024-08-13T00:00:00.000Z"
  },
  {
    "id": 15,
    "title": "Back-End Developer",
    "company": "Twitter",
    "location": "Mumbai",
    "type": "Full-time",
    "salary": "13LPA - 16LPA",
    "experience": "4-6 Years",
    "opening": "15",
    "application": "200",
    "description": "Develop and maintain server-side applications. Design and implement APIs and microservices. Experience with server-side languages such as Java, Python, or Node.js. Knowledge of database management.",
    "companyType": "Tech",
    "benefits": "Health insurance. Stock options. Flexible working hours.",
    "shift": "Day Shift",
    "department": "Engineering",
    "education": "UG: Any Graduate. PG: Degree in Computer Science or related field.",
    "skills": "Java. Python. Node.js. API Development. Microservices. Database Management.",
    "email": "careers@twitter.com",
    "aboutcompany": "Twitter is a global social media platform providing news and information through tweets. For more details visit www.twitter.com.",
    "postedDate": "2024-08-14T00:00:00.000Z"
  },
  {
    "id": 16,
    "title": "UI/UX Designer",
    "company": "Adobe",
    "location": "Noida",
    "type": "Full-time",
    "salary": "10LPA - 12LPA",
    "experience": "3-5 Years",
    "opening": "30",
    "application": "175",
    "description": "Design intuitive and engaging user interfaces. Conduct user research and usability testing. Collaborate with developers to ensure designs are implemented effectively. Experience with design tools like Sketch, Figma.",
    "companyType": "Tech",
    "benefits": "Health benefits. Paid vacation. Career growth opportunities.",
    "shift": "Day Shift",
    "department": "Design",
    "education": "UG: Any Graduate. PG: Degree in Design or related field.",
    "skills": "UI Design. UX Design. User Research. Usability Testing. Design Tools. Prototyping.",
    "email": "jobs@adobe.com",
    "aboutcompany": "Adobe is a multinational computer software company known for its creative and multimedia software products. For more details visit www.adobe.com.",
    "postedDate": "2024-08-15T00:00:00.000Z"
  },
  {
    "id": 17,
    "title": "Machine Learning Engineer",
    "company": "NVIDIA",
    "location": "Bangalore",
    "type": "Full-time",
    "salary": "14LPA - 18LPA",
    "experience": "4-7 Years",
    "opening": "12",
    "application": "160",
    "description": "Develop and deploy machine learning models. Work on AI and deep learning projects. Experience with frameworks like TensorFlow, PyTorch. Strong programming skills in Python.",
    "companyType": "Tech",
    "benefits": "Health benefits. Performance bonuses. Stock options.",
    "shift": "Day Shift",
    "department": "AI & Machine Learning",
    "education": "UG: Any Graduate. PG: Degree in Computer Science or related field.",
    "skills": "Machine Learning. Deep Learning. Python. TensorFlow. PyTorch. AI Development.",
    "email": "careers@nvidia.com",
    "aboutcompany": "NVIDIA is a global leader in graphics processing units (GPUs) and AI technologies. For more details visit www.nvidia.com.",
    "postedDate": "2024-08-16T00:00:00.000Z"
  },
  {
    "id": 18,
    "title": "Cybersecurity Analyst",
    "company": "McAfee",
    "location": "Hyderabad",
    "type": "Full-time",
    "salary": "11LPA - 14LPA",
    "experience": "3-6 Years",
    "opening": "10",
    "application": "140",
    "description": "Monitor and respond to security incidents. Implement and maintain security measures. Conduct vulnerability assessments and penetration testing. Experience with security tools and protocols.",
    "companyType": "Tech",
    "benefits": "Health insurance. Paid time off. Professional development.",
    "shift": "Day Shift",
    "department": "Security",
    "education": "UG: Any Graduate. PG: Degree in Cybersecurity or related field.",
    "skills": "Cybersecurity. Incident Response. Vulnerability Assessment. Penetration Testing. Security Tools.",
    "email": "jobs@mcafee.com",
    "aboutcompany": "McAfee is a global cybersecurity company providing advanced security solutions for individuals and businesses. For more details visit www.mcafee.com.",
    "postedDate": "2024-08-17T00:00:00.000Z"
  },
  {
    "id": 19,
    "title": "Data Scientist",
    "company": "IBM",
    "location": "Gurgaon",
    "type": "Full-time",
    "salary": "15LPA - 20LPA",
    "experience": "5-8 Years",
    "opening": "8",
    "application": "130",
    "description": "Analyze complex data sets to drive business insights. Develop predictive models and algorithms. Experience with data analysis tools and programming languages. Strong skills in Python and R.",
    "companyType": "Tech",
    "benefits": "Health benefits. Stock options. Professional development.",
    "shift": "Day Shift",
    "department": "Data Science",
    "education": "UG: Any Graduate. PG: Degree in Data Science or related field.",
    "skills": "Data Analysis. Predictive Modeling. Python. R. Machine Learning. Data Visualization.",
    "email": "careers@ibm.com",
    "aboutcompany": "IBM is a global technology and consulting company offering a wide range of services including cloud solutions, AI, and data analytics. For more details visit www.ibm.com.",
    "postedDate": "2024-08-18T00:00:00.000Z"
  },
  {
    "id": 20,
    "title": "Product Manager",
    "company": "Google",
    "location": "Bangalore",
    "type": "Full-time",
    "salary": "18LPA - 22LPA",
    "experience": "6-9 Years",
    "opening": "6",
    "application": "210",
    "description": "Lead product development from concept to launch. Collaborate with cross-functional teams to define product vision and strategy. Experience in managing product roadmaps and stakeholder communication.",
    "companyType": "Tech",
    "benefits": "Health insurance. Stock options. Career growth opportunities.",
    "shift": "Day Shift",
    "department": "Product Management",
    "education": "UG: Any Graduate. PG: MBA or equivalent.",
    "skills": "Product Management. Roadmap Planning. Stakeholder Communication. Market Research. Strategic Planning.",
    "email": "careers@google.com",
    "aboutcompany": "Google is a global technology leader specializing in internet-related services and products. For more details visit www.google.com.",
    "postedDate": "2024-08-19T00:00:00.000Z"
  }
]
